<?php

/***
 *
 * Задача: Есть генератор random01(), который в случайном порядке выдаёт нули или единицы.
 * Нужно на его основе написать random0123(), который выдаёт случайные 0 или 1 или 2 или 3.
 *
 *  Заметки: 
 *  0000 - 0 = 0 * 2 ^ 3 + 0 * 2 ^ 2 + 0 * 2 ^ 1 + 0 * 2 ^ 0
 *  0001 - 1 = 0 * 2 ^ 3 + 0 * 2 ^ 2 + 0 * 2 ^ 1 + 1 * 2 ^ 0
 *  0010 - 2 = 0 * 2 ^ 3 + 0 * 2 ^ 2 + 1 * 2 ^ 1 + 0 * 2 ^ 0
 *  0011 - 3 = 0 * 2 ^ 3 + 0 * 2 ^ 2 + 1 * 2 ^ 1 + 1 * 2 ^ 0
 *  ....
 *  0111 - 7 = 0 * 2 ^ 3 + 1 * 2 ^ 2 + 1 * 2 ^ 1 + 1 * 2 ^ 0
 *
 **/


function random01()
{
    return rand(0,1);
}

function random0123()
{
    $rand1 = random01();
    $rand2 = random01();

    return bindec($rand1 . $rand2);
}

for ($i=0; $i<10; $i++) {
    print " число 0123 " . random0123() . " ";
}

function random012()
{
    $rand = random0123();
    if ($rand == 3) {
        $rand = random012();
    }     
    return $rand;
}




}
